In [1]:
import pandas as pd

In [4]:
from sklearn.datasets import load_iris

iris = load_iris()

In [16]:
# Load Titanic dataset
titanic = fetch_openml(name='Titanic', version=1, as_frame=True)
df = titanic.frame

# Create passenger_info table
passenger_info = df[['pclass', 'name', 'sex', 'age']].copy()
passenger_info['PassengerId'] = range(1, len(passenger_info) + 1)

# Create journey_info table
journey_info = df[['pclass', 'ticket', 'fare', 'cabin', 'embarked']].copy()
journey_info['PassengerId'] = range(1, len(journey_info) + 1)

# Set PassengerId as index (primary key)
passenger_info.set_index('PassengerId', inplace=True)
journey_info.set_index('PassengerId', inplace=True)

c:\Users\CB.EN.U4CSE20614\LAM-Research\SyntheticDataGenerator\Code\venv\Lib\site-packages\sklearn\datasets\_openml.py:1022: FutureWarning: The default value of `parser` will change from `'liac-arff'` to `'auto'` in 1.4. You can set `parser='auto'` to silence this warning. Therefore, an `ImportError` will be raised from 1.4 if the dataset is dense and pandas is not installed. Note that the pandas parser may return different data types. See the Notes Section in fetch_openml's API doc for details.
  warn(

In [17]:
# Merge the two tables back into a single table
combined_df = pd.merge(passenger_info, journey_info, on='PassengerId')

In [18]:
passenger_info

,pclass,name,sex,age
PassengerId,,,,
1,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000
2,1.0,"Allison, Master. Hudson Trevor",male,0.9167
3,1.0,"Allison, Miss. Helen Loraine",female,2.0000
4,1.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000
5,1.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000
...,...,...,...,...
1305,3.0,"Zabour, Miss. Hileni",female,14.5000
1306,3.0,"Zabour, Miss. Thamine",female,NaN
1307,3.0,"Zakarian, Mr. Mapriededer",male,26.5000
1308,3.0,"Zakarian, Mr. Ortin",male,27.0000
1309,3.0,"Zimmerman, Mr. Leo",male,29.0000

In [19]:
journey_info

             pclass  ticket      fare    cabin embarked
PassengerId
1               1.0   24160  211.3375       B5        S
2               1.0  113781  151.5500  C22 C26        S
3               1.0  113781  151.5500  C22 C26        S
4               1.0  113781  151.5500  C22 C26        S
5               1.0  113781  151.5500  C22 C26        S
...             ...     ...       ...      ...      ...
1305            3.0    2665   14.4542      NaN        C
1306            3.0    2665   14.4542      NaN        C
1307            3.0    2656    7.2250      NaN        C
1308            3.0    2670    7.2250      NaN        C
1309            3.0  315082    7.8750      NaN        S

[1309 rows x 5 columns]

In [20]:
combined_df

,pclass_x,name,sex,age,pclass_y,ticket,fare,cabin,embarked
PassengerId,,,,,,,,,
1,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,1.0,24160,211.3375,B5,S
2,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,113781,151.5500,C22 C26,S
3,1.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,113781,151.5500,C22 C26,S
4,1.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,113781,151.5500,C22 C26,S
5,1.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,113781,151.5500,C22 C26,S
...,...,...,...,...,...,...,...,...,...
1305,3.0,"Zabour, Miss. Hileni",female,14.5000,3.0,2665,14.4542,NaN,C
1306,3.0,"Zabour, Miss. Thamine",female,NaN,3.0,2665,14.4542,NaN,C
1307,3.0,"Zakarian, Mr. Mapriededer",male,26.5000,3.0,2656,7.2250,NaN,C
1308,3.0,"Zakarian, Mr. Ortin",male,27.0000,3.0,2670,7.2250,NaN,C
1309,3.0,"Zimmerman, Mr. Leo",male,29.0000,3.0,315082,7.8750,NaN,S